import { Content } from "../../models/content";

export const IntegerData: Content[] = [
    {
        id: "int1",
        topic: "ความหมายของจำนวนเต็ม",
        data: `
                <p>จำนวนเต็ม (integer) หมายถึง จำนวนที่ปราศจากองค์ประกอบของเศษส่วน หรือทศนิยม อันได้แก่ $$...,-3,-2,-1,0,1,2,3,...$$</p>
                <p>โดยจำนวนเต็มสามารถแบ่งออกได้เป็นสามประเภท ได้แก่ จำนวนเต็มบวก (positive integer) ศูนย์ (zero) และจำนวนเต็มลบ (negative integer)</p>
                <ul>
                    <li>จำนวนเต็มบวก หมายถึง จำนวนเต็มที่มีค่ามากกว่าศูนย์ ได้แก่ $$1,2,3,4,5,6,7,...$$ ซึ่งจำนวนเต็มบวก ก็คือ จำนวนนับ</li>
                    <li>ศูนย์ หมายถึง จำนวนเต็มที่มีค่าเป็นศูนย์ ได้แก่ $$0$$</li>
                    <li>จำนวนเต็มลบ หมายถึง จำนวนเต็มที่มีค่าน้อยกว่าศูนย์ ได้แก่ $$-1,-2,-3,-4,-5,-6,-7,...$$</li>
                </ul>
                <p>ทั้งนี้ จำนวนเต็มยังสามารถแบ่งประเภทเป็นจำนวนคู่ หรือจำนวนคี่ โดยการหารด้วยสองดังเดิมได้</p>
              `
    },
    {
        id: "int2",
        topic: "จำนวนเต็มบนเส้นจำนวน",
        data: `
                <p>เส้นจำนวน (number line) หมายถึง แผนภาพหนึ่งมิติ ที่แสดงเส้นตรงที่ใช้ จุด แบ่งคั่นเส้นตรงเป็นส่วนเท่า ๆ กัน โดยปกติ จุดแต่ละจุดจะแสดงถึงจำนวนเต็ม ซึ่งจากซ้ายไปขวา จำนวนจะมีค่าจากน้อยกว่าไปมากกว่า ดังรูป</p>
                <div class="container-fluid text-center my-5">
                    <img class="img-fluid" src="assets/images/math/integer/nl1.svg">
                </div>
                <p>จากรูป เมื่อให้ศูนย์เป็นจุด ๆ หนึ่งบนเส้นจำนวน ทุก ๆ จุดที่อยู่ทางซ้ายของศูนย์จะเป็นจำนวนเต็มลบ และทุก ๆ จุดที่อยู่ทางขวาของศูนย์จะเป็นจำนวนเต็มบวก</p>
              `
    },
    {
        id: "int3",
        topic: "การเปรียบเทียบจำนวนเต็ม",
        data: `
                <p>การเปรียบเทียบจำนวนเต็ม ในที่นี้ เพื่อให้เห็นภาพ จะใช้เส้นจำนวนในการเปรียบเทียบ</p>
                <p>สมมติให้ $A,B$ เป็นจำนวนเต็มใด ๆ</p>
                <ul>
                    <li>ถ้า $A$ อยู่ทางขวาของ $B$ บนเส้นจำนวน แล้ว $A\\gt B$</li>
                    <li>ถ้า $A$ อยู่ทางซ้ายของ $B$ บนเส้นจำนวน แล้ว $A\\lt B$</li>
                    <li>ถ้า $A$ อยู่จุดเดียวกับ $B$ บนเส้นจำนวน แล้ว $A=B$</li>
                </ul>
                <h5>ตัวอย่างของการเปรียบเทียบจำนวนเต็ม</h5>
                <div class="p-3">
                    <p>จงทำการเปรียบเทียบ $-4$ กับ $3$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/ic1.svg">
                    </div>
                    <p>เนื่องจาก $-4$ อยู่ทางซ้ายของ $3$ บนเส้นจำนวน</p>
                    <p>ดังนั้น $-4 \\lt 3$</p>
                </div>
                <div class="p-3">
                    <p>จงทำการเปรียบเทียบ $-2$ กับ $-5$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/ic2.svg">
                    </div>
                    <p>เนื่องจาก $-2$ อยู่ทางขวาของ $-5$ บนเส้นจำนวน</p>
                    <p>ดังนั้น $-2 \\gt -5$</p>
                </div>
              `
    },
    {
        id: "int4",
        topic: "ค่าสัมบูรณ์ของจำนวนเต็ม",
        data: `
                <p>กำหนดให้ $A$ เป็นจำนวนเต็มใด ๆ</p>
                <p>ค่าสัมบูรณ์ (absolute value) ของ $A$ หมายถึง ระยะทางจาก $A$ ไปถึง $0$ หรืออีกนัยหนึ่ง คือ ผลต่างระหว่างค่าของ $A$ กับ $0$ เขียนแทนด้วย $|A|$</p>
                <h5>ตัวอย่างของการเปรียบเทียบจำนวนเต็ม</h5>
                <div class="p-3">
                    <p>จงหาค่าสัมบูรณ์ของ $-3$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/abs1.svg">
                    </div>
                    <p>เนื่องจาก $-3$ อยู่ห่างจาก $0$ เป็นระยะทาง $3$ หน่วย</p>
                    <p>ดังนั้น $|-3|=3$</p>
                </div>
                <div class="p-3">
                    <p>จงหาค่าสัมบูรณ์ของ $3$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/abs2.svg">
                    </div>
                    <p>เนื่องจาก $3$ อยู่ห่างจาก $0$ เป็นระยะทาง $3$ หน่วย</p>
                    <p>ดังนั้น $|3|=3$</p>
                </div>
                <div class="p-3">
                    <p>จงหาค่าสัมบูรณ์ของ $0$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/abs3.svg">
                    </div>
                    <p>เนื่องจาก $0$ อยู่ห่างจาก $0$ เป็นระยะทาง $0$ หน่วย</p>
                    <p>ดังนั้น $|0|=0$</p>
                </div>
                <p>จากตัวอย่างเมื่อลองขยายจำนวนให้มากขึ้น จะพบว่าค่าสัมบูรณ์ที่ได้จะมีค่ามากกว่าหรือเท่ากับศูนย์ หรือก็คือ ไม่เป็นจำนวนลบ</p>
                <p>กำหนดให้ $A$ เป็นจำนวนเต็มใด ๆ แล้ว $|A|$ จะมีค่าไม่เป็นลบเสมอ $(|A|\\geq 0)$</p>
                <p>และจากตัวอย่าง ยังพบว่า $|-3|=|3|=3$</p>
                <p>จำนวนเต็มบวก และจำนวนเต็มลบที่มีค่าสัมบูรณ์เท่ากัน จะเรียกว่าเป็นจำนวนตรงข้ามกัน $(|A|=|-A|)$</p>
              `
    },
    {
        id: "int5",
        topic: "การบวกจำนวนเต็ม",
        data: `
                <p>ในที่นี้ เราจะยังคงใช้เส้นจำนวน เพื่อทำการบวกจำนวนเต็ม ซึ่งมีเงื่อนไข ดังนี้</p>
                <p>กำหนดให้ $A,B$ เป็นจำนวนเต็ม $A+B$ เป็นนิพจน์การบวก ซึ่ง $A$ เป็นตัวตั้ง และ $B$ เป็นตัวบวก</p>
                <p>เริ่มต้นบนเส้นจำนวน กำหนดจุด $A$</p>
                <div class="container-fluid text-center my-5">
                    <img class="img-fluid" src="assets/images/math/integer/add1.svg">
                </div>
                <ul>
                    <li>ถ้า $B$ เป็นจำนวนเต็มบวก ให้เพิ่มค่า $A$ (เลื่อนค่าไปทางขวาของ $A$) เป็นระยะทาง $|B|$ หน่วย</li>
                    <li>ถ้า $B$ เป็นจำนวนเต็มลบ ให้ลดค่า $A$ (เลื่อนค่าไปทางซ้ายของ $A$) เป็นระยะทาง $|B|$ หน่วย</li>
                    <li>ถ้า $B$ เป็นศูนย์ จะได้ $A$ (ไม่มีการเลื่อนค่า)</li>
                </ul>
                <h5>ตัวอย่างของการเปรียบเทียบจำนวนเต็ม</h5>
                <div class="p-3">
                    <p>จงหาค่าของ $(-4)+3$ </p>
                    <div class="container-fluid text-center my-5">
                        <img class="img-fluid" src="assets/images/math/integer/add2.svg">
                    </div>
                    <p>เนื่องจาก $-1$ อยู่ทางขวาของ $-4$ เป็นระยะทาง $|3|$ หน่วย</p>
                    <p>ดังนั้น $(-4)+3=-1$</p>
                </div>
              `
    }
]